ERP DEV.WMS/src/Catalogs/вмс_Операции/вмс_Операции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Операции</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДанныеСКД</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщикуРаспоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьУслугиХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперацииХранилище</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяФорма</name>
    <type>
      <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВФормеСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРаспоряжению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поток</name>
    <type>
      <types>EnumRef.вмс_СкладскиеПотоки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредопределенныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазбиватьПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнвентаризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДанныеСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлассОперацииХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРаспоряжение</name>
      <type>
        <types>CatalogRef.вмс_РаспоряженияОпераций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыОперации</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.вмс_ЭтапыОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.вмс_СтатусыДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОперации</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_СвойстваОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственноеХранение</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПочтовыеРассылки</name>
    <attributes>
      <name>Рассылка</name>
      <type>
        <types>CatalogRef.вмс_ПочтовыеРассылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Активная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <type>
        <types>CatalogRef.вмс_Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриСохранении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриЗавершении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоКонвертации</name>
      <type>
        <types>CatalogRef.вмс_ПравилаКонвертацииРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработкиПередЗавершением</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлана</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОперации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаФронтенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаБэкенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормыОперации</name>
    <attributes>
      <name>МакетФормы</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетодыОперации</name>
    <attributes>
      <name>ИмяМетода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормыKPI</name>
    <attributes>
      <name>КоличествоМинут</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>EnumRef.вмс_ЕдиницыИзмеренияKPI</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/InformationRegisters/вмс_ЖурналИсполнения/вмс_ЖурналИсполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ЖурналИсполнения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.вмс_ЭтапыОперации</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Операции/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ПолучитьЭлементСправочникаОперацииПоИмени(СлужебноеИмя) Экспорт

	Возврат Справочники.вмс_Операции.НайтиПоРеквизиту("ИмяДляПоиска",СлужебноеИмя);

КонецФункции

Функция ОперацияПоРаспоряжению(СлужебноеИмя) Экспорт

	Возврат Справочники.вмс_Операции.НайтиПоРеквизиту("ИмяДляПоиска",СлужебноеИмя).ПоРаспоряжению = Истина; 
	
КонецФункции

Функция ПолучитьОписаниеТиповРаспоряженийОперации(СлужебноеИмя) Экспорт
	
	РаспоряженияМассивомСтрок = ПолучитьМассивСтрокРаспоряженийОперации(СлужебноеИмя);
	
	Если РаспоряженияМассивомСтрок = Неопределено  Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить распоряжения для операции " + СлужебноеИмя;
		Сообщение.Сообщить();
		ЗаписьЖурналаРегистрации("ПолучитьОписаниеТиповРаспоряженийОперации",УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.вмс_Операции,,"Распоряжения массивом строк вернуло ""Неопределено"" для операции " + СлужебноеИмя);
		Возврат Неопределено;
		
	Иначе
		
		МассивОТ = Новый Массив;
		
		Для каждого Элемент Из РаспоряженияМассивомСтрок Цикл
		
			ТипРаспоряжения = Новый ОписаниеТипов("ДокументСсылка."+Элемент);
			МассивОТ.Добавить(ТипРаспоряжения);
		
		КонецЦикла;
		
		Возврат МассивОТ;
	
	КонецЕсли;

	

КонецФункции

Функция ПолучитьМассивСтрокРаспоряженийОперации(СлужебноеИмя) Экспорт
	
	Если ОперацияПоРаспоряжению(СлужебноеИмя) Тогда

	Операция = Справочники.вмс_Операции.НайтиПоРеквизиту("ИмяДляПоиска",СлужебноеИмя);
	
	Если ЗначениеЗаполнено(Операция) Тогда
		
		СтрокаОпераций = Операция.СоставРаспоряжений.Получить();
		
		Если Не ЗначениеЗаполнено(СтрокаОпераций) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Пустой список распорядений для операции " + СлужебноеИмя;
			Сообщение.Сообщить();
			ЗаписьЖурналаРегистрации("ПолучитьМассивСтрокРаспоряженийОперации",УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.вмс_Операции,,"Пустой список распорядений для операции " + СлужебноеИмя);
			Возврат Неопределено;
		Иначе
			Возврат вмс_РаботаСКоллекциями.СтрокуВМассив(СтрокаОпераций);
		КонецЕсли;
	
		
	Иначе 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция " + СлужебноеИмя + " не найдена. Обратитесь к разработчику";
		Сообщение.Сообщить();
		ЗаписьЖурналаРегистрации("ПолучитьМассивСтрокРаспоряженийОперации",УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.вмс_Операции,,"Не нашли операцию по служебному имени " + СлужебноеИмя);
		Возврат Неопределено;
	КонецЕсли;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция не поддерживает распоряжения";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОписаниеОперации(СлужебноеИмя) Экспорт
	
	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяДляПоиска", СлужебноеИмя);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Операции.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СсылкаНаОперацию
	|ИЗ
	|	Справочник.вмс_Операции КАК вмс_Операции
	|ГДЕ
	|	вмс_Операции.ИмяДляПоиска = &ИмяДляПоиска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_Операции.Ссылка КАК Ссылка,
	|	вмс_Операции.ПоРаспоряжению КАК ПоРаспоряжению
	|ПОМЕСТИТЬ РеквизитыОперации
	|ИЗ
	|	Справочник.вмс_Операции КАК вмс_Операции
	|ГДЕ
	|	вмс_Операции.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СсылкаНаОперацию.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_СсылкаНаОперацию КАК ВТ_СсылкаНаОперацию)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацииМетодыОперации.Ссылка КАК Ссылка,
	|	вмс_ОперацииМетодыОперации.ИмяМетода КАК ИмяМетода,
	|	вмс_ОперацииМетодыОперации.Данные КАК Данные
	|ПОМЕСТИТЬ МетодыОперации
	|ИЗ
	|	Справочник.вмс_Операции.МетодыОперации КАК вмс_ОперацииМетодыОперации
	|ГДЕ
	|	вмс_ОперацииМетодыОперации.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СсылкаНаОперацию.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_СсылкаНаОперацию КАК ВТ_СсылкаНаОперацию)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацииПараметрыОперации.Ссылка КАК Ссылка,
	|	вмс_ОперацииПараметрыОперации.Имя КАК Имя,
	|	вмс_ОперацииПараметрыОперации.НаФронтенде КАК НаФронтенде,
	|	вмс_ОперацииПараметрыОперации.НаБэкенде КАК НаБэкенде
	|ПОМЕСТИТЬ ПараметрыОперации
	|ИЗ
	|	Справочник.вмс_Операции.ПараметрыОперации КАК вмс_ОперацииПараметрыОперации
	|ГДЕ
	|	вмс_ОперацииПараметрыОперации.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СсылкаНаОперацию.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_СсылкаНаОперацию КАК ВТ_СсылкаНаОперацию)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СсылкаНаОперацию";
	
	Запрос.Выполнить();
	
	ОписаниеОперации = Новый Структура;
	
	Для Каждого Таблица Из Запрос.МенеджерВременныхТаблиц.Таблицы Цикл
		ДанныеТаблицы = Таблица.ПолучитьДанные().Выгрузить();
		Если Таблица.ПолноеИмя = "РеквизитыОперации" Тогда
			МассивИменКолонок = РК.ВыгрузитьЗначенияКолонкиКоллекции(ДанныеТаблицы.Колонки, "Имя");
			ИменаКолонок = РК.МассивВСтроку(МассивИменКолонок);
			Данные = Новый Структура(ИменаКолонок);
			Если ДанныеТаблицы.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(Данные, ДанныеТаблицы[0]);
			КонецЕсли;
		Иначе
			Данные = ДанныеТаблицы;
		КонецЕсли;
		
		ОписаниеОперации.Вставить(Таблица.ПолноеИмя, Данные);
	КонецЦикла;
	
	Возврат ОписаниеОперации;
	
КонецФункции

Функция ПолучитьСписокДокументовПоОперации(ВходящиеПараметры) Экспорт 	
	НастройкиКолонок = Новый ТаблицаЗначений;
	НастройкиКолонок.Колонки.Добавить("Имя");
	НастройкиКолонок.Колонки.Добавить("Заголовок");
	НастройкиКолонок.Колонки.Добавить("Ширина");
	
	ДанныеСпискаДокументов = Новый Структура;
	ДанныеСпискаДокументов.Вставить("НастройкиКолонок", НастройкиКолонок);
	ДанныеСпискаДокументов.Вставить("УсловноеОформление", Неопределено);
	ДанныеСпискаДокументов.Вставить("Таблица", Новый ТаблицаЗначений);
	
	Операция = ВходящиеПараметры.Операция;
	
	Если Операция.ПоРаспоряжению Тогда
		// ТУ_КС совместимость с новой архитектурой+
		Если Операция.Распоряжения.Количество() > 0 Тогда
			Распоряжения = Операция.Распоряжения.ВыгрузитьКолонку("СсылкаНаРаспоряжение");
		Иначе
			Распоряжения = Новый Массив;
			Распоряжения.Добавить(Операция);
		КонецЕсли;
		// ТУ_КС совместимость с новой архитектурой-
		
		Для Каждого Распоряжение Из Распоряжения Цикл 
			
			//РезультатРаспоряжения = Справочники.вмс_Операции.ПолучитьДанныеПоРаспоряжению(Операция, Распоряжение.СсылкаНаРаспоряжение, ВходящиеПараметры);
			//РезультатРаспоряжения = Справочники.вмс_Операции.ПолучитьДанныеПоРаспоряжению(Операция, Операция, ВходящиеПараметры);
			
			// ТУ_КС совместимость с новой архитектурой+
			РезультатРаспоряжения = Справочники.вмс_Операции.ПолучитьДанныеПоРаспоряжению(Операция, Распоряжение, ВходящиеПараметры);
			// ТУ_КС совместимость с новой архитектурой-
			
			Если РезультатРаспоряжения <> Неопределено Тогда
				вмс_РаботаСКоллекциями.РазтипизироватьТаблицуЗначений(РезультатРаспоряжения.Таблица); //Нужно, т.к. в одной операции могут быть документы разных типов
				вмс_РаботаСКоллекциями.ДополнитьКолонкиТаблицыЗначений(ДанныеСпискаДокументов.Таблица, , РезультатРаспоряжения.Таблица);
				вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ДанныеСпискаДокументов.Таблица, РезультатРаспоряжения.Таблица); 
				
				Для Каждого Колонка Из РезультатРаспоряжения.Таблица.Колонки Цикл
					НайденныеНастройкиКолонок = НастройкиКолонок.НайтиСтроки(Новый Структура("Имя", Колонка.Имя));
					Если НайденныеНастройкиКолонок.Количество() > 0 Тогда
						НастройкаКолонки = НайденныеНастройкиКолонок[0];
						НастройкаКолонки.Заголовок = Колонка.Заголовок;
						НастройкаКолонки.Ширина = Колонка.Ширина;
					КонецЕсли;
				КонецЦикла; 
				
				Для Каждого ПолеВыбора Из РезультатРаспоряжения.НастройкиКомпоновки.Выбор.Элементы Цикл
					Если ПолеВыбора.Использование Тогда
						Если ТипЗнч(ПолеВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
							ИмяПоля = Строка(ПолеВыбора.Поле);
							ИмяПоля = СтрЗаменить(ИмяПоля, ".", "");
							Если НастройкиКолонок.Найти(ИмяПоля, "Имя") = Неопределено Тогда
								НастройкаКолонки = НастройкиКолонок.Добавить();
								НастройкаКолонки.Имя = ИмяПоля;
								НастройкаКолонки.Заголовок = ПолеВыбора.Заголовок;
								НастройкаКолонки.Ширина = 0;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				УсловноеОформлениеСлепок = вмс_РаботаСКоллекциями.СделатьСлепокДанных(РезультатРаспоряжения.НастройкиКомпоновки.УсловноеОформление,
				"(РежимОтображения,Элементы[(Использование,Отбор(Элементы[(Использование,Представление,Родитель(),ЛевоеЗначение,ВидСравнения,ПравоеЗначение,ТипГруппы,Элементы[%r1])]),Поля(Элементы[(Использование,Поле)]),Оформление(Элементы[(Использование,Параметр,Значение)]))])");
				
				ДанныеСпискаДокументов.УсловноеОформление = УсловноеОформлениеСлепок;
			КонецЕсли;
		КонецЦикла;	 
		
		Если Операция.Распоряжения.Количество() = 1 Тогда
			Если РезультатРаспоряжения.НастройкиКомпоновки.Порядок.Элементы.Количество()=0 Тогда
				// сортировка по умолчанию
				ДанныеСпискаДокументов.Таблица.Сортировать("Дата Убыв");
			КонецЕсли;
		ИначеЕсли Операция.Распоряжения.Количество() > 1 Тогда
			// сквозная сортировка
			ДанныеСпискаДокументов.Таблица.Сортировать("Дата Убыв");
		КонецЕсли;
	КонецЕсли;
	
	// //ТУ_Самойленко 04.04.23 ++
	//Если Операция.ИмяДляПоиска = "ВыборочнаяИнвентаризация" Тогда
	//	Возврат ПостобработкаДанныхСпискаДокументов(ДанныеСпискаДокументов, ВходящиеПараметры.Оператор.Оператор);	
	//Иначе
	Возврат ДанныеСпискаДокументов;   
	//КонецЕсли;
	// //ТУ_Самойленко 04.04.23 --
	
КонецФункции

Функция ПолучитьКоличествоДокументовПоОперации(ВходящиеПараметры) Экспорт 
	
	Попытка
		Возврат ПолучитьСписокДокументовПоОперации(ВходящиеПараметры).Таблица.Количество();
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции

Функция ПостобработкаДанныхСпискаДокументов(ДанныеСпискаДокументов, Оператор)
	
	СкрываемыеРаспоряжения = Новый Массив;
	
	// Проверка на наличие исполнителя ++
	Для Каждого Распоряжение Из ДанныеСпискаДокументов.Таблица Цикл
		СкрытьРаспоряжение = Истина;
		Для Каждого Строка Из Распоряжение.Ссылка.Товары Цикл			
			Если Строка.Исполнитель = Оператор Тогда
				СкрытьРаспоряжение = Ложь;
				Прервать;				
			КонецЕсли;			
		КонецЦикла;
		Если СкрытьРаспоряжение Тогда
			СкрываемыеРаспоряжения.Добавить(Распоряжение);	
		КонецЕсли;
	КонецЦикла;
	// Проверка на наличие исполнителя -- 
	
	// Проверка завершения исполнителем ++
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ЖурналИсполнения.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.вмс_ЖурналИсполнения КАК вмс_ЖурналИсполнения
	|ГДЕ
	|	вмс_ЖурналИсполнения.Ответственный = &Ответственный
	|	И вмс_ЖурналИсполнения.Статус = &Статус
	|";
	Запрос.УстановитьПараметр("Ответственный", Оператор);
	Запрос.УстановитьПараметр("Статус", Справочники.вмс_ЭтапыОперации.НайтиПоНаименованию("Завершена"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.вмс_ВыборочнаяИнвентаризация") Тогда
			НайденныеСтроки = ДанныеСпискаДокументов.Таблица.НайтиСтроки(Новый Структура("Ссылка", Выборка.Документ));
			Если ЗначениеЗаполнено(НайденныеСтроки) И СкрываемыеРаспоряжения.Найти(Выборка.Документ) = Неопределено Тогда
				СкрываемыеРаспоряжения.Добавить(Выборка.Документ);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// Проверка завершения исполнителем --
	
	// Полная чистка ++
	Для Каждого Распоряжение Из СкрываемыеРаспоряжения Цикл
		УдаляемыеСтроки = ДанныеСпискаДокументов.Таблица.НайтиСтроки(Новый Структура("Ссылка", Распоряжение.Ссылка));
		Для Каждого Строка Из УдаляемыеСтроки Цикл
			ДанныеСпискаДокументов.Таблица.Удалить(Строка);	
		КонецЦикла;
	КонецЦикла;
	// Полная чистка --
	
	Возврат ДанныеСпискаДокументов;
	
КонецФункции

Функция УстановитьРабочиеСтатусыВНастройкахСКДСпискаДокументов(Операция, СхемаКомпоновкиДанных) Экспорт
	НастройкиСКД = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки;
	ПредставлениеОтбора = "Отбор по рабочим статусам";
	ОтборПоРабочимСтатусам = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(НастройкиСКД.Отбор.Элементы, Новый Структура("Представление", ПредставлениеОтбора));
	Если ОтборПоРабочимСтатусам = Неопределено Тогда
		ОтборПоРабочимСтатусам = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоРабочимСтатусам.Представление = ПредставлениеОтбора;
	КонецЕсли; 
	
	СписокРабочихСтатусов = Новый СписокЗначений;      
	
	ЭтапКОбработке = Справочники.вмс_ЭтапыОперации.НайтиПоРеквизиту("Имя", "КОбработке");
	
	СтрокиРабочихСтатусов = Операция.ЭтапыОперации.НайтиСтроки(Новый Структура("Этап", ЭтапКОбработке));
	МассивРабочихСтатусовКОбработке = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиРабочихСтатусов, "Статус");
	
	
	ЭтапВРаботе = Справочники.вмс_ЭтапыОперации.НайтиПоРеквизиту("Имя", "ВРаботе");
	
	СтрокиРабочихСтатусов = Операция.ЭтапыОперации.НайтиСтроки(Новый Структура("Этап", ЭтапВРаботе));
	МассивРабочихСтатусовВРаботе = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиРабочихСтатусов, "Статус");
	
	МассивРабочихСтатусов = вмс_РаботаСКоллекциями.СложениеМассивов(МассивРабочихСтатусовКОбработке,МассивРабочихСтатусовВРаботе);
	СписокРабочихСтатусов.ЗагрузитьЗначения(МассивРабочихСтатусов);
	
	ОтборПоРабочимСтатусам.Использование = Истина;
	ОтборПоРабочимСтатусам.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборПоРабочимСтатусам.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоРабочимСтатусам.ПравоеЗначение = СписокРабочихСтатусов;
КонецФункции

Функция УстановитьОперациюВНастройкахСКДСпискаДокументов(Операция, СхемаКомпоновкиДанных) Экспорт
	
	НастройкиСКД = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки;
	
	ПредставлениеОтбора = "Операция";
	ОтборПоОперации = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(НастройкиСКД.Отбор.Элементы, Новый Структура("Представление", ПредставлениеОтбора));
	
	Если ОтборПоОперации = Неопределено Тогда
		ОтборПоОперации = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоОперации.Представление = ПредставлениеОтбора;
	КонецЕсли;

	ОтборПоОперации.Использование = Истина;
	ОтборПоОперации.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Операция");
	ОтборПоОперации.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоОперации.ПравоеЗначение = Операция;
	
КонецФункции

Функция УстановитьОтборПоСкладам(Склады, НастройкиСКД) Экспорт
	ПредставлениеОтбора = "Отбор по складам";
	ОтборПоСкладам = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(НастройкиСКД.Отбор.Элементы, Новый Структура("Представление", ПредставлениеОтбора));
	Если ОтборПоСкладам = Неопределено Тогда
		ОтборПоСкладам = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоСкладам.Представление = ПредставлениеОтбора;
	КонецЕсли; 
	
	СписокСкладов = Новый СписокЗначений;
	СписокСкладов.ЗагрузитьЗначения(Склады);
	
	ОтборПоСкладам.Использование = Истина;
	ОтборПоСкладам.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Склад");
	ОтборПоСкладам.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоСкладам.ПравоеЗначение = СписокСкладов;
КонецФункции

Функция ПолучитьДанныеПоРаспоряжению(Операция, Распоряжение, ВходящиеПараметры, ВыводВТабличныйДокумент = Ложь) Экспорт
	// ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
	Если ВыводВТабличныйДокумент Тогда
		РезультатТабДок = Новый ТабличныйДокумент;
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанных");
	Иначе
		Результат = Неопределено;
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	КонецЕсли;	//
	
	Попытка
		// ТУ_КС совместимость с новой архитектурой+
		Если ТипЗнч(Распоряжение)=Тип("СправочникСсылка.вмс_Операции") Тогда
			//3.2.5 - Переход на отдельное хранилище данных
			//СхемаКомпоновкиДанных = Распоряжение.ХранилищеСКДЗаданияКладовщику.Получить();
			СхемаКомпоновкиДанных = Справочники.вмс_ИсточникиДанных.ИсточникДанных("ХранилищеСКДЗаданияКладовщику", Распоряжение);
		Иначе
			//3.2.5 - Переход на отдельное хранилище данных
			//СхемаКомпоновкиДанных = Распоряжение.ХранилищеСКДДокументы.Получить();
			СхемаКомпоновкиДанных = Справочники.вмс_ИсточникиДанных.ИсточникДанных("ХранилищеСКДДокументы", Распоряжение);
		КонецЕсли;
		// ТУ_КС совместимость с новой архитектурой-
		
		Если СхемаКомпоновкиДанных <> Неопределено Тогда
			УстановитьРабочиеСтатусыВНастройкахСКДСпискаДокументов(Операция, СхемаКомпоновкиДанных);
			//УстановитьОперациюВНастройкахСКДСпискаДокументов(Операция, СхемаКомпоновкиДанных);
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки);
			НастройкиКомпоновки = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
			
			ПоляКомпоновкиОтборов = вмс_РаботаСКоллекциями.СтрокуВМассив("Ссылка, Номер, Дата");
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(НастройкиКомпоновки.УсловноеОформление.Элементы, "Отбор.Элементы");
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЭлементыКоллекцииВМассив(ЭлементыОтборов, 1);
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ПреобразоватьИерархическуюКоллекциюВПлоскую(ЭлементыОтборов, "Элементы");
			ЗначенияОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(ЭлементыОтборов, "ЛевоеЗначение, ПравоеЗначение");
			
			Для Каждого ЗначениеОтбора Из ЗначенияОтборов Цикл
				Если ТипЗнч(ЗначениеОтбора) = Тип("ПолеКомпоновкиДанных") Тогда
					ИмяПоля = Строка(ЗначениеОтбора);
					Если ПоляКомпоновкиОтборов.Найти(ИмяПоля) = Неопределено Тогда
						ПоляКомпоновкиОтборов.Добавить(ИмяПоля);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			РаботаССКД.ВключитьПоляВыбораНастроекСКД(НастройкиКомпоновки, ПоляКомпоновкиОтборов);
			РаботаССКД.УстановитьНастройкиДляПолученияКоллекцииЗначений(НастройкиКомпоновки);
			
			// Отбор по складам  
			Попытка
				Если ВходящиеПараметры.Свойство("Оператор") Тогда
					Склады = Справочники.вмс_НастройкиОператора.ПолучитьДоступныеСкладыОператора(ВходящиеПараметры.Оператор);
					Если ЗначениеЗаполнено(Склады) Тогда
						УстановитьОтборПоСкладам(Склады, НастройкиКомпоновки);
					КонецЕсли;
				КонецЕсли;
			Исключение
				ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			КонецПопытки;
			// Отбор по складам 
			
			// установка операции параметром 
			ПараметрСКДОперация = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Операция");
			Если ПараметрСКДОперация <> Неопределено Тогда
				ПараметрСКДОперация.Значение = Операция;
				ПараметрСКДОперация.Использование = Истина;
			КонецЕсли;
			// установка операции параметром 
			
			// установка операции параметром (по имени операции)
			ПараметрСКДОперацияИмя = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ОперацияИмяДляПоиска");
			Если ПараметрСКДОперацияИмя <> Неопределено Тогда
				ПараметрСКДОперацияИмя.Значение = Операция.ИмяДляПоиска;
				ПараметрСКДОперацияИмя.Использование = Истина;
			КонецЕсли;
			// установка операции параметром    
			
			// установить одноименные параметры скд
			Для Каждого ВходящийПараметр Из ВходящиеПараметры Цикл
				ПараметрСКД = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти(ВходящийПараметр.Ключ);
				Если ПараметрСКД <> Неопределено Тогда
					ПараметрСКД.Значение = ВходящийПараметр.Значение;
					ПараметрСКД.Использование = Истина;
				КонецЕсли;
			КонецЦикла;
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки,,, ТипКомпоновщикаМакета);
			
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
			
			// ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
			// При просмотре результатов, обработка данных заканчивается здесь, если будут изменения в логике после этого
			// момента, может привести к расхождениям результатов на ТСД и в учетке при просмотре.
			Если ВыводВТабличныйДокумент Тогда					
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
				ПроцессорВывода.УстановитьДокумент(РезультатТабДок);
				ПроцессорВывода.Вывести(ПроцессорКомпоновки);
			Иначе
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
				Таблица = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
				
				Результат = Новый Структура;
				Результат.Вставить("Таблица", Таблица);
				Результат.Вставить("НастройкиКомпоновки", НастройкиКомпоновки);
			КонецЕсли;
			//
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	// ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
	Если ВыводВТабличныйДокумент Тогда
		Возврат РезультатТабДок;
	Иначе
		Возврат Результат;
	КонецЕсли;
	//
КонецФункции

Функция ПолучитьМакетЭлементов(знач СписокОбъектов=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Операции.Наименование КАК Наименование,
	|	вмс_Операции.Ссылка КАК Ссылка,
	|	вмс_Операции.Родитель КАК Родитель,
	|	вмс_Операции.ИмяДляПоиска КАК ИмяДляПоиска,
	|	вмс_Операции.ПоРаспоряжению КАК ПоРаспоряжению,
	|	вмс_Операции.ОбработкаВФормеСписка КАК ОбработкаВФормеСписка,
	|	вмс_Операции.ЗапрашиватьУслугиХранения КАК ЗапрашиватьУслугиХранения,
	|	вмс_Операции.ИмяФормы КАК ИмяФормы,
	|	вмс_Операции.НачальнаяФорма КАК НачальнаяФорма,
	|	вмс_Операции.КлассОперации КАК КлассОперации,
	|	вмс_Операции.КлассОперацииХранилище КАК КлассОперацииХранилище,
	|	вмс_Операции.ХранилищеСКДЗаданияКладовщику КАК ХранилищеСКДЗаданияКладовщику,
	|	вмс_Операции.ЗаданиеКладовщикуРаспоряжение КАК ЗаданиеКладовщикуРаспоряжение,
	|	вмс_Операции.ХранилищеСКДДокументы КАК ХранилищеСКДДокументы,
	|	вмс_Операции.ДанныеСКД КАК ДанныеСКД,
	|	вмс_Операции.ЭтапыОперации.(
	|		НомерСтроки КАК НомерСтроки,
	|		Этап КАК Этап,
	|		Статус КАК Статус
	|	) КАК ЭтапыОперации,
	|	вмс_Операции.ДополнительныеРеквизиты.(
	|		Свойство КАК Свойство,
	|		Значение КАК Значение
	|	) КАК ДополнительныеРеквизиты
	|ИЗ
	|	Справочник.вмс_Операции КАК вмс_Операции
	|ГДЕ
	|	(&БезОтбора
	|				И НЕ вмс_Операции.ПометкаУдаления
	|			ИЛИ НЕ &БезОтбора
	|				И вмс_Операции.Ссылка В (&СписокСсылокНаОбъекты))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	БезОтбора = Истина;
	СписокСсылокНаОбъекты = Новый Массив;
	ТипСсылка = Тип("СправочникСсылка.вмс_Операции");
	ТипОбъекта = Тип("СправочникОбъект.вмс_Операции");
	Если СписокОбъектов <> Неопределено Тогда
		БезОтбора = Ложь;
		Для Каждого Объект Из СписокОбъектов Цикл
			Если ТипЗнч(Объект)=ТипСсылка Тогда
				СписокСсылокНаОбъекты.Добавить(Объект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Запрос.УстановитьПараметр("БезОтбора", БезОтбора);
	Запрос.УстановитьПараметр("СписокСсылокНаОбъекты", СписокСсылокНаОбъекты);
	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаОбъектов = РезультатЗапроса.Выгрузить();
	ТаблицаОбъектов.Колонки.Добавить("ВерсияВМС");
	
	Если СписокОбъектов <> Неопределено Тогда
		Для Каждого Объект Из СписокОбъектов Цикл
			Если ТипЗнч(Объект)=ТипСсылка Тогда
				Продолжить;
			КонецЕсли;

			СтрокаТаблицыОбъектов = ТаблицаОбъектов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыОбъектов, Объект);
			Если ТипЗнч(Объект)=ТипОбъекта И Объект.ЭтоНовый() Тогда
				СтрокаТаблицыОбъектов.Ссылка = Объект.ПолучитьСсылкуНового();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Индекс = 0;
	Для Каждого Ссылка Из СписокСсылокНаОбъекты Цикл
		НайденнаяСтрокаМассив = ТаблицаОбъектов.НайтиСтроки(Новый Структура("Ссылка", Ссылка));
		Если НайденнаяСтрокаМассив.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяСтрока = НайденнаяСтрокаМассив[0];
		ТекущийИндекс = ТаблицаОбъектов.Индекс(НайденнаяСтрока);
		Если ТекущийИндекс <> Индекс Тогда
			ТаблицаОбъектов.Сдвинуть(ТекущийИндекс, Индекс-ТекущийИндекс);
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;

	ВерсияВМС = вмс_ОбновлениеИнформационнойБазыWMS.Версия();
	Для Каждого СтрокаТаблицыОбъектов Из ТаблицаОбъектов Цикл
		СтрокаТаблицыОбъектов.ВерсияВМС = ВерсияВМС;
	КонецЦикла;
	
	Макет = Новый ТабличныйДокумент;
	НомерСтроки = 1;
	НомерКолонки = 1;
	Для Каждого Колонка Из ТаблицаОбъектов.Колонки Цикл
		Макет.Область(НомерСтроки, НомерКолонки).Текст = Колонка.Имя;
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	ЗаписьXML = Новый ЗаписьXML;
	ПараметрыЗаписиXML = вмс_РаботаСXMLКлиентСервер.ПолучитьПараметрыЗаписиXML(ЗаписьXML, Истина);
	вмс_РаботаСXMLКлиентСервер.ПодготовитьОбъектыИЗначенияСвойствОбъектовДляЗаписи(ПараметрыЗаписиXML, ТаблицаОбъектов);
	
	НомерСтроки = НомерСтроки + 1;
	Для Каждого СтрокаТаблицыОбъектов Из ТаблицаОбъектов Цикл
		НомерКолонки = 1;
		Для Каждого Колонка Из ТаблицаОбъектов.Колонки Цикл
			Значение = СтрокаТаблицыОбъектов[Колонка.Имя];
			Область = Макет.Область(НомерСтроки, НомерКолонки);
			
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			ПараметрыЗаписиXML.ЗаписьXML = ЗаписьXML;
			вмс_РаботаСXMLКлиентСервер.ЗаписатьОбъект(Значение, ПараметрыЗаписиXML);
			Текст = ЗаписьXML.Закрыть();
			
			Если ТипЗнч(Значение) <> Тип("ТаблицаЗначений") Тогда
				// только содержимое значения без тэгов в одну строку
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.УстановитьСтроку(Текст);
				ЧтениеXML.Прочитать();
				Текст = вмс_РаботаСXMLКлиентСервер.ПрочитатьСодержимоеТекущегоУзлаXML(ЧтениеXML);
			КонецЕсли;
			
			Область.Текст = Текст;
			Область.ВысотаСтроки = 10;
			
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат Макет;
	
КонецФункции


Функция ЗагрузитьЭлементыИзМакета(Макет, ВерсияВМСОт=Неопределено) Экспорт
	
	Возврат вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета(Макет, Тип("СправочникОбъект.вмс_Операции"), ВерсияВМСОт);
	
КонецФункции

// ТУ_Кошелев_07.06.24 - изменения в связи с новой системой формирования запросов СКД распоряжений операций
Функция НайтиТипРаспоряженияДляДокумента(Документ, ВидОперации) Экспорт	
	Если ТипЗнч(Документ) = Тип("Строка") Тогда
		ИмяДокумента = Документ;
	Иначе
		ИмяДокумента = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаОбъекта(Документ);
	КонецЕсли;
	
	Если ИмяДокумента <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Имя", ИмяДокумента);
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	вмс_ОперацииРаспоряжения.СсылкаНаРаспоряжение КАК Ссылка
		|ИЗ
		|	Справочник.вмс_Операции.Распоряжения КАК вмс_ОперацииРаспоряжения
		|ГДЕ
		|	вмс_ОперацииРаспоряжения.Ссылка = &ВидОперации
		|	И вмс_ОперацииРаспоряжения.СсылкаНаРаспоряжение.РаспоряжениеКонфигуратор = &Имя";

		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		ТипыРаспоряжений = ТаблицаЗапроса.ВыгрузитьКолонку("Ссылка");
	Иначе
		ТипыРаспоряжений = Новый Массив;
	КонецЕсли;
	
	Если ТипыРаспоряжений.Количество() = 1 Тогда
		// исключить дублирование
		Возврат ТипыРаспоряжений[0];
	КонецЕсли;	
КонецФункции

#КонецЕсли
